{
  "programs": [
    {
      "id": "cancer-awareness-camp",
      "title": "Cancer Awareness Cum Detection Camp",
      "shortDescription": "Regular camps for cancer awareness and early detection in Tibetan communities.",
      "fullDescription": "Our Cancer Awareness Cum Detection Camps are comprehensive events organized in various Tibetan settlements to raise awareness about cancer and provide free screening services. These camps combine educational sessions with practical screening activities, helping community members understand cancer risks while offering immediate screening services for early detection.",
      "icon": "Search",
      "image": "/assets/programs/health-camp.jpg",
      "features": [
        "Free cancer screening services",
        "Educational workshops about cancer prevention",
        "Distribution of awareness materials in Tibetan",
        "One-on-one consultations with healthcare professionals",
        "Follow-up care coordination for positive screenings"
      ],
      "stats": [
        {
          "value": "1500+",
          "label": "People Screened"
        },
        {
          "value": "25+",
          "label": "Camps Conducted"
        }
      ]
    },
    {
      "id": "world-cancer-day",
      "title": "World Cancer Day",
      "shortDescription": "Annual events and activities to mark World Cancer Day on February 4th.",
      "fullDescription": "Every year on February 4th, we organize special events to mark World Cancer Day. These events aim to inspire action, raise awareness, and reduce stigma around cancer in the Tibetan community. Our World Cancer Day activities include educational sessions, survivor testimonials, memorial ceremonies, and community engagement initiatives that promote cancer prevention and support.",
      "icon": "Calendar",
      "image": "/assets/programs/cancer-day.jpg",
      "features": [
        "Annual awareness campaigns",
        "Community gatherings and educational sessions",
        "Cancer survivor testimonials",
        "Memorial ceremonies for those lost to cancer",
        "Free screening opportunities"
      ],
      "stats": [
        {
          "value": "1000+",
          "label": "Annual Participants"
        },
        {
          "value": "7",
          "label": "Years of Celebration"
        }
      ]
    },
    {
      "id": "compassion-home",
      "title": "Compassion Home",
      "shortDescription": "A safe and supportive residence for cancer patients undergoing treatment away from home.",
      "fullDescription": "Compassion Home provides temporary accommodation for cancer patients who need to travel away from their homes for treatment. Our facility offers a comfortable, supportive environment where patients can stay during their treatment period, reducing the financial and logistical burden of finding accommodation near treatment centers.",
      "icon": "Home",
      "image": "/assets/programs/compassion-home.JPG",
      "features": [
        "Safe and comfortable accommodation",
        "Nutritious meals prepared with care",
        "Transportation to and from treatment centers",
        "Emotional support from staff and fellow residents",
        "Regular visits from healthcare professionals"
      ],
      "stats": [
        {
          "value": "200+",
          "label": "Patients Housed"
        },
        {
          "value": "3000+",
          "label": "Nights of Accommodation Provided"
        }
      ]
    },
    {
      "id": "ambulance-services",
      "title": "Ambulance Services",
      "shortDescription": "Emergency and scheduled transportation for cancer patients to medical facilities.",
      "fullDescription": "Our Ambulance Services provide critical transportation for cancer patients who need to reach medical facilities for treatment, emergencies, or routine appointments. This service is especially important for elderly patients and those with mobility issues, ensuring they can access necessary medical care without transportation barriers.",
      "icon": "Truck",
      "image": "/assets/programs/ambulance.png",
      "features": [
        "24/7 emergency transportation",
        "Scheduled transportation for appointments",
        "Trained medical staff on board",
        "Equipped with essential medical supplies",
        "Service available across all Tibetan settlements"
      ],
      "stats": [
        {
          "value": "300+",
          "label": "Patients Transported"
        },
        {
          "value": "5000+",
          "label": "Kilometers Traveled"
        }
      ]
    },
    {
      "id": "community-kitchen",
      "title": "Community Kitchen",
      "shortDescription": "Providing nutritious meals for cancer patients and their families during treatment.",
      "fullDescription": "Our Community Kitchen program prepares and delivers nutritious meals to cancer patients and their families. Proper nutrition is crucial during cancer treatment, yet many patients struggle with meal preparation due to fatigue, treatment side effects, or financial constraints. Our kitchen provides healthy, specially prepared meals that support patients' nutritional needs during treatment.",
      "icon": "Utensils",
      "image": "/assets/programs/community-kitchen.jpg",
      "features": [
        "Nutritionally balanced meals designed for cancer patients",
        "Consideration of dietary restrictions and preferences",
        "Home delivery service",
        "Meals for patients and immediate family members",
        "Nutrition education and counseling"
      ],
      "stats": [
        {
          "value": "10,000+",
          "label": "Meals Provided"
        },
        {
          "value": "150+",
          "label": "Families Supported"
        }
      ]
    },
    {
      "id": "meals-for-invisibles",
      "title": "Meals for Invisibles",
      "shortDescription": "Providing food for homeless and underprivileged cancer patients who often go unnoticed.",
      "fullDescription": "The Meals for Invisible project began as an urgent response to the devastating impact of the COVID-19 pandemic on the most vulnerable in our community—drug addicts, substance abusers, destitute individuals, and others often overlooked due to stigma. These \"Invisible\" members faced acute hunger, poverty, and lack of access to basic needs. Over two months, the project provided nutritious two-time meals daily to over 100 underprivileged people, helping boost their immunity and protect them from the virus. It also created opportunities for stranded youth to volunteer and earn wages, easing their financial burdens during difficult times. Today, the project has grown into a broader food charity drive, extending support to disadvantaged Indian destitute, poor patients seeking medical care at government hospitals, daily wagers, and others in need. With the help of generous donors, meals are provided regularly, often sponsored in honor of birthdays, death anniversaries, and other significant occasions. Meals for Invisible continues to serve as a vital lifeline, restoring dignity and hope to those society often forgets.",
      "icon": "Coffee",
      "image": "/assets/programs/MFI.png",
      "features": [
        "Daily meal distribution in key locations",
        "Nutritionally complete meal packages",
        "Outreach to identify and support homeless cancer patients",
        "Coordination with local shelters and social services",
        "Additional support services referrals"
      ],
      "stats": [
        {
          "value": "5,000+",
          "label": "Meals Distributed"
        },
        {
          "value": "75+",
          "label": "Regular Recipients"
        }
      ]
    },
    {
      "id": "sunday-program",
      "title": "Sunday Program",
      "shortDescription": "Weekly gatherings for cancer patients and survivors to connect, share, and heal together.",
      "fullDescription": "Our Sunday Program provides a regular gathering space for cancer patients, survivors, and their families. Every Sunday, we host activities that promote healing, connection, and emotional wellbeing. These gatherings include support group discussions, meditation sessions, art therapy, educational talks, and simply sharing meals together in a supportive community environment.",
      "icon": "Users",
      "image": "/assets/programs/sundayprogram.jpg",
      "features": [
        "Weekly support group meetings",
        "Meditation and mindfulness sessions",
        "Creative expression through art therapy",
        "Educational talks from healthcare professionals",
        "Community meals and social connection"
      ],
      "stats": [
        {
          "value": "50+",
          "label": "Regular Attendees"
        },
        {
          "value": "200+",
          "label": "Sessions Conducted"
        }
      ]
    }
  ]
}