{
  "programs": [
    {
      "id": "cancer-awareness-camp",
      "title": "Cancer Awareness Cum Detection Camp",
      "shortDescription": "Regular camps for cancer awareness and early detection in Tibetan communities.",
      "fullDescription": "Our Cancer Awareness Cum Detection Camps are comprehensive events organized in various Tibetan settlements to raise awareness about cancer and provide free screening services. These camps combine educational sessions with practical screening activities, helping community members understand cancer risks while offering immediate screening services for early detection.",
      "icon": "Search",
      "image": "/assets/programs/health-camp.jpg",
      "features": [
        "Free cancer screening services",
        "Educational workshops about cancer prevention",
        "Distribution of awareness materials in Tibetan",
        "One-on-one consultations with healthcare professionals",
        "Follow-up care coordination for positive screenings"
      ],
      "stats": [
        {
          "value": "45,000",
          "label": "People Screened"
        },
        {
          "value": "144+",
          "label": "Campus"
        },
        {
          "value": "39.21%",
          "label": "H. pylori Positive"
        },
        {
          "value": "60.79%",
          "label": "H. pylori Negative"
        }
      ]
    },
    {
      "id": "world-cancer-day",
      "title": "World Cancer Day",
      "shortDescription": "Annual events and activities to mark World Cancer Day on February 4th.",
      "fullDescription": "Every year on February 4th, we organize special events to mark World Cancer Day. These events aim to inspire action, raise awareness, and reduce stigma around cancer in the Tibetan community. Our World Cancer Day activities include educational sessions, survivor testimonials, memorial ceremonies, and community engagement initiatives that promote cancer prevention and support.",
      "icon": "Calendar",
      "image": "/assets/programs/cancer-day.jpg",
      "features": [
        "Annual awareness campaigns",
        "Community gatherings and educational sessions",
        "Cancer survivor testimonials",
        "Memorial ceremonies for those lost to cancer",
        "Free screening opportunities"
      ],
      "stats": [
        {
          "value": "10+",
          "label": "Years of Celebration"
        },
        {
          "value": "1000+",
          "label": "Annual Participants"
        },
        {
          "value": "UICC",
          "label": "Member Organization"
        },
        {
          "value": "5+",
          "label": "Event Locations"
        }
      ]
    },
    {
      "id": "compassion-home",
      "title": "Compassion Home",
      "shortDescription": "A safe and supportive residence for cancer patients undergoing treatment away from home.",
      "fullDescription": "Compassion Home, an initiative of the Tibetan Cancer Society, provides a safe and welcoming haven for cancer patients who must travel far from home to receive treatment. Our facility offers a peaceful and supportive environment where patients can stay throughout their treatment journey, easing the emotional, financial, and logistical challenges of finding accommodation near hospitals. We are dedicated to offering comfort, dignity, and care to those facing cancer, helping them feel at home even when they are far from their own.",
      "icon": "Home",
      "image": "/assets/programs/compassion-home.JPG",
      "features": [
        "Safe and comfortable accommodation",
        "Nutritious meals prepared with care",
        "Transportation to and from treatment centers",
        "Emotional support from staff and fellow residents",
        "Regular visits from healthcare professionals"
      ],
      "stats": [
        {
          "value": "200+",
          "label": "Patients Housed"
        },
        {
          "value": "3000+",
          "label": "Nights of Accommodation"
        },
        {
          "value": "2",
          "label": "Safe Locations"
        },
        {
          "value": "9+",
          "label": "Years of Service"
        }
      ]
    },
    {
      "id": "ambulance-services",
      "title": "Ambulance Services",
      "shortDescription": "Emergency and scheduled transportation for cancer patients to medical facilities.",
      "fullDescription": "Our Ambulance Services are a lifeline for cancer patients who need safe and reliable transportation to hospitals and clinics for treatment, emergencies, or regular check-ups. This service is especially crucial for elderly individuals and those with mobility challenges, helping them access critical medical care without the burden of transportation difficulties. Operated by the Tibetan Cancer Society, our ambulances serve everyone in need, regardless of background or financial status. From Delhi to distant states like Bihar, Karnataka, Sikkim, and Ladakh, we reach patients even in the most remote areas. While we operate on a low-cost model, we provide full services free of charge to those who are financially disadvantaged. Our mission is to ensure that no one is denied care because of distance or poverty. Our ambulances bring hope, dignity, and compassion wherever they go.",
      "icon": "Truck",
      "image": "/assets/programs/ambulance.png",
      "features": [
        "24/7 emergency transportation",
        "Scheduled transportation for appointments",
        "Trained medical staff on board",
        "Equipped with essential medical supplies",
        "Service available across all Tibetan settlements"
      ],
      "stats": [
        {
          "value": "750+",
          "label": "Total Services"
        },
        {
          "value": "1,55,000",
          "label": "Total K.M. Covered"
        },
        {
          "value": "Dynamic",
          "label": "Patient Stories"
        },
        {
          "value": "24/7",
          "label": "Emergency Availability"
        }
      ]
    },
    {
      "id": "community-kitchen",
      "title": "Community Kitchen",
      "shortDescription": "Providing nutritious meals for cancer patients and their families during treatment.",
      "fullDescription": "Our Community Kitchen prepares and delivers nutritious, healing meals to cancer patients and their families, recognizing that proper nutrition is essential during treatment but often difficult to maintain due to fatigue, side effects, or financial challenges. To support patients during this critical time, we provide carefully prepared meals designed to meet their specific dietary needs. Beyond cancer care, we are committed to serving vulnerable members of our community by offering nutritious, unlimited meals at no cost to Tibetan homeless individuals, people struggling with or recovering from addiction, sex workers, and anyone who cannot afford a meal. Our kitchen is a place of nourishment, compassion, and dignity, where everyone in need is welcomed and cared for.",
      "icon": "Utensils",
      "image": "/assets/programs/community-kitchen.jpg",
      "features": [
        "Nutritionally balanced meals designed for cancer patients",
        "Consideration of dietary restrictions and preferences",
        "Home delivery service",
        "Meals for patients and immediate family members",
        "Nutrition education and counseling"
      ],
      "stats": [
        {
          "value": "2",
          "label": "Active Kitchens"
        },
        {
          "value": "1000+",
          "label": "People Served Daily"
        },
        {
          "value": "2",
          "label": "Strategic Locations"
        },
        {
          "value": "5+",
          "label": "Years of Service"
        }
      ]
    },
    {
      "id": "meals-for-invisibles",
      "title": "Meals for Invisibles",
      "shortDescription": "Providing food for homeless and underprivileged cancer patients who often go unnoticed.",
      "fullDescription": "The Meals for Invisible project began as an urgent response to the devastating impact of the COVID-19 pandemic on the most vulnerable in our community—drug addicts, substance abusers, destitute individuals, and others often overlooked due to stigma. These \"Invisible\" members faced acute hunger, poverty, and lack of access to basic needs. Over two months, the project provided nutritious two-time meals daily to over 100 underprivileged people, helping boost their immunity and protect them from the virus. It also created opportunities for stranded youth to volunteer and earn wages, easing their financial burdens during difficult times. Today, the project has grown into a broader food charity drive, extending support to disadvantaged Indian destitute, poor patients seeking medical care at government hospitals, daily wagers, and others in need. With the help of generous donors, meals are provided regularly, often sponsored in honor of birthdays, death anniversaries, and other significant occasions. Meals for Invisible continues to serve as a vital lifeline, restoring dignity and hope to those society often forgets.",
      "icon": "Coffee",
      "image": "/assets/programs/MFI.png",
      "features": [
        "Daily meal distribution in key locations",
        "Nutritionally complete meal packages",
        "Outreach to identify and support homeless cancer patients",
        "Coordination with local shelters and social services",
        "Additional support services referrals"
      ],
      "stats": [
        {
          "value": "1,25,000+",
          "label": "Meals Provided"
        },
        {
          "value": "1500+",
          "label": "Generous Sponsors"
        },
        {
          "value": "100+",
          "label": "Beneficiaries"
        },
        {
          "value": "5+",
          "label": "Years of Service"
        }
      ]
    },
    {
      "id": "sunday-program",
      "title": "Sunday Program",
      "shortDescription": "Weekly gatherings for cancer patients and survivors to connect, share, and heal together.",
      "fullDescription": "Our Sunday Program offers a peaceful and supportive space where cancer patients, survivors, and their families can come together each week to connect, heal, and find comfort in community. Every Sunday, we host a variety of activities that nourish emotional wellbeing and foster a sense of belonging, including support group discussions, guided meditation, art therapy, educational talks, and the simple joy of sharing a meal. It is a day to step away from the noise and routines of hospitals and leave behind the quiet isolation of the compassion home. Instead, participants are invited to enjoy a change of environment, experience fresh air, and spend meaningful time surrounded by understanding hearts in a warm and welcoming setting.",
      "icon": "Users",
      "image": "/assets/programs/sundayprogram.jpg",
      "features": [
        "Weekly support group meetings",
        "Meditation and mindfulness sessions",
        "Creative expression through art therapy",
        "Educational talks from healthcare professionals",
        "Community meals and social connection"
      ],
      "stats": [
        {
          "value": "50+",
          "label": "Regular Attendees"
        },
        {
          "value": "200+",
          "label": "Sessions Conducted"
        },
        {
          "value": "Weekly",
          "label": "Support Meetings"
        },
        {
          "value": "5+",
          "label": "Years Running"
        }
      ]
    }
  ]
}