{
  "testimonials": [
    {
      "id": 1,
      "name": "Deckyi Lhazom",
      "age": 43,
      "diagnosis": "Polyp",
      "location": "Chanthang, Ladakh",
      "image": "/assets/testimonials/Deckyi Lhazom.png",
      "quote": "In the remote corners of Ladakh lived a resilient mother of many, quietly carrying the weight of her world. She belonged to the underprivileged category under the Central Tibetan Administration, where survival often took precedence over self-care. A year ago, during a rare medical outreach at Sonam Memorial Hospital, visiting doctors found signs of what they feared was cervical cancer. They urged immediate surgery. But with no funds and a large family to care for, traveling to Delhi felt like an impossible dream. Months passed. Another team of doctors visiting Leh suspected heart issues and advised waiting for a cardiologist. Meanwhile, she endured a year of untimely bleeding and pain, suffering in silence. It wasn’t until the summer, during our Tibetan Cancer Society health camp, that her story reached us. We immediately brought her to Delhi, hoping for answers and relief. At the Delhi State Cancer Institute, doctors gave her unexpected news—she did not have cervical or breast cancer. Instead, they found polyps that likely caused the pain and bleeding. She was referred to Holy Family Hospital for a polypectomy, but by then, a severe infection—caused by poor hygiene—had set in, delaying treatment once again.She began medication to clear the infection, with plans to undergo surgery once her condition improved. Through it all, her strength never wavered.Her and her husband's travel, treatment, and living expenses were fully supported by the Tibetan Cancer Society, along with generous help from Mrs. Consuelo Torres of Spain, mother of our member Ms. Karma Yangdon.This was not just a story of illness—it was a story of courage, compassion, and the quiet power of community coming together when it mattered most.",
      "date": "2021"
    },
    {
      "id": 2,
      "name": "Late Rinchen Lida",
      "age": 66,
      "diagnosis": "Malignant Melanorma",
      "location": "Tuting, Arunachal Pradesh",
      "image": "/assets/testimonials/Late Rinchen Lida.png",
      "quote": "The patient, a humble and soft-spoken man, had been diagnosed with malignant melanoma at the cancer hospital in Dibrugarh, Assam. His condition was serious, and he was referred to Rajiv Gandhi Cancer Hospital in Delhi for advanced treatment. Upon arrival, doctors found a large and painful lump near his groin and proposed an expensive immunotherapy using Opdyta injections—a foreign-imported drug designed to target specific tumors. Each injection cost nearly one lakh rupees, and he was advised to take six of them. For the patient and his family, this recommendation was not just medically overwhelming but financially devastating.By the time the Tibetan Cancer Society learned of his case, the family was preparing to take a massive loan to begin the treatment. We stepped in without hesitation. Understanding the emotional and financial burden, we approached the hospital and requested the patient be discharged under the reason that he was not yet mentally ready for such an aggressive and costly procedure. We assured them he would return once he was prepared.Once under the care of TCS, we immediately brought him to the Delhi State Cancer Institute for a complete reevaluation. There, to our surprise and sorrow, doctors concluded that his body was in no condition to handle the recommended immunotherapy. He was in the terminal stage, and the injections—despite their high cost—would have made little to no difference in his outcome.Rather than allowing the patient to slip into debt for a treatment that offered no hope, we focused on what mattered most—his comfort and dignity. Palliative radiotherapy was arranged to ease his pain, and with the support of CanSupport NGO, he received morphine and compassionate end-of-life care.Though we could not save his life, we were able to give him peace in his final days and protect his family from the burden of crushing debt. All costs were fully borne by the Tibetan Cancer Society. His journey ended not in suffering, but surrounded by care, respect, and the quiet love of a community that stood by him when he needed it most.",
      "date": "2021"
    },
    {
      "id": 3,
      "name": "Rinchen Bhuti",
      "age": 65,
      "diagnosis": "Carninoma Stomach Antropyloric",
      "location": "Dirang, Arunachal Pradesh",
      "image": "/assets/testimonials/Rinchen Bhuti.png",
      "quote": "It was her daughter who first reached out to us—her voice filled with worry and desperation. Her mother had been diagnosed with carcinoma of the stomach (antropyloric region) with a gastric outlet obstruction. The local hospital, Tomo RIBA State Hospital, had turned them away, telling the family there was no treatment left and advising them to take her home to prepare for the inevitable. For a daughter to hear those words about her mother was devastating.But hope had not left her heart. She came to the Tibetan Cancer Society in search of a second chance—and we knew we had to help.We immediately called the patient to Delhi and began her initial investigations at Delhi State Cancer Institute. From there, she was referred to GB Pant Hospital for possible surgical intervention. It was a long and uncertain road—almost a month of tests, appointments, and waiting. But we were determined to leave no stone unturned.Thanks to the compassion and expertise of Dr. Amit Javed and his surgical team, she was finally admitted. The surgery was carried out with great care, and slowly, she began to improve. Day by day, strength returned to her frail body. The woman who had once been told to go home and prepare for death was now walking on her own, smiling and regaining her spirit.She was discharged on April 24th, 2019, in remarkably good health. There were no signs of pain or complications. In fact, her daughter later shared with us, beaming with joy, that her mother had even gained weight and was doing wonderfully well at home.This was more than just a medical success—it was a story of unwavering love, of second chances, and of a community that refused to give up. With timely intervention, coordinated care, and collective compassion, a life that had been written off was restored with hope, dignity, and renewed strength.",
      "date": "2019"
    },
    {
      "id": 4,
      "name": "late Ani Kunga Choezin",
      "age": 47,
      "diagnosis": "Neuroendocrine Tumor",
      "location": "Rajpur, Dehradun",
      "image": "/assets/testimonials/late Ani Kunga Choezin.png",
      "quote": "She was diagnosed with a neuroendocrine tumor—a rare and challenging illness. For months, she went through numerous investigations, shuttling between Delhi State Cancer Institute and Rajiv Gandhi Cancer Hospital. Despite all efforts, both hospitals reached the same heartbreaking conclusion: there was no curative treatment available. They prescribed only analgesics to manage her pain and gently told her that she might have, at best, five years to live. It was a painful moment for all of us—accepting that hope seemed to be slipping away.Just as we were beginning to come to terms with the reality, something miraculous happened. We heard of another patient, Tendil Dolma, who had once been told her cancer was unresectable. Yet, against all odds and after being turned away by several hospitals, she had undergone a successful surgery.Inspired by her story, we brought Tendil Dolma’s reports to the renowned Dr. Amit Javed. As he reviewed the case, his face lit up—not with doubt, but with hope. He believed there was a chance for our patient too. That single moment reignited a fire of belief in all of us, and from that point forward, we never looked back.She was started on Octreotide injections, a treatment aimed at shrinking the tumor to a size where surgery would become possible. Incredibly, within the very first month, her condition began to improve. The constant pain that once confined her to medication was no longer there. She stopped taking analgesics, and her energy slowly returned.The journey was not over yet, but the road ahead no longer looked dark. With continued treatment and close monitoring, the doctors grew hopeful that they could operate and remove the tumor entirely in the near future. Later Ani la passed awar peacefully.Her story became one of revival and resilience—a beautiful reminder that even when the odds are against us, there is always room for a fighting spirit. ",
      "date": "2019"
    },
    {
      "id": 5,
      "name": "Jamphel Sangpo",
      "age": 86,
      "diagnosis": "Carcinoma Stomach Cancer",
      "location": "Vasant Kunj, Delhi",
      "image": "/assets/testimonials/5.png",
      "quote": "He was diagnosed with terminal-stage stomach carcinoma. At his advanced age, and with his frail physical condition, the doctors concluded that neither curative treatment nor aggressive palliative procedures could be safely administered. His body was simply too vulnerable to endure further interventions. It was a painful reality—for his family, and for all of us who stood by him.But even when medical science could offer no cure, we knew there was still something deeply meaningful we could provide: comfort, dignity, and love in his final journey.Together with the CAN Support team, the Tibetan Cancer Society stepped in to provide end-of-life care. Our priority was to ensure that his final days were not filled with suffering, but with peace. We arranged regular visits from compassionate doctors and trained nurses—completely free of cost. They provided medical support, emotional comfort, and ensured that he remained as pain-free as possible through proper palliative medication and attentive care.Each visit was more than a routine check—it was a gesture of kindness and a symbol of the care that surrounded him. His family, though overwhelmed with sorrow, found solace in knowing he was being looked after with such compassion. He spent his final days in the comfort of his own home, surrounded by loved ones, and passed away peacefully—with dignity, and without pain.After his passing, we continued to support his grieving family. We made sure that they did not have to navigate the difficult bureaucratic process alone. The Tibetan Cancer Society helped arrange the official death certificate and ensured it was delivered to their doorstep, removing the added stress during such an emotionally heavy time.His story reminded us that even when a cure is not possible, care always is. Through collective compassion and thoughtful support, we helped him leave this world with grace—and offered his family the comfort of knowing he was not alone. In the face of loss, it became a story of humanity, love, and the quiet power of standing beside someone when it matters most.",
      "date": "2021"
    },
    {
      "id": 6,
      "name": "Tenzin Yangkyi",
      "age": 30,
      "diagnosis": "Acute Promyelocytic leukaemia (APL)",
      "location": "Disclosed",
      "image": "/assets/testimonials/Tenzin Yangkyi.png",
      "quote": "In June 2018, she received a life-altering diagnosis—acute promyelocytic leukemia (APL), a rare but treatable form of blood cancer. Her world turned upside down as she and her family rushed to Fortis Hospital in Bangalore, hoping to begin treatment immediately. But what awaited them was a crushing blow—the estimated cost for her full treatment was a minimum of ₹13 lakhs, an amount far beyond what her family could ever afford.Just when hope seemed to slip away, the Tibetan Cancer Society stepped in. We knew that she deserved every chance to live. With the generous help and guidance of Dr. K.B. Lingegowda, the former Director of Kidwai Cancer Institute, we were able to secure her admission into the renowned government cancer hospital. Thanks to his unwavering support and belief in her case, she received the full course of treatment completely free of cost.In addition to medical care, the Tibetan Cancer Society also provided ₹20,000 to her family to cover any additional expenses during the course of her treatment—travel, food, or anything else that might ease their burden.With treatment underway at Kidwai, she showed tremendous strength and resilience. Slowly but steadily, her health began to improve. By March 2019, her treatment was complete. And on June 15, 2019, just a year after her diagnosis, she was officially declared cured.From a young woman standing on the edge of uncertainty to a brave survivor standing tall, her journey was a powerful testament to hope, community, and the will to live. She didn’t just survive cancer—she reclaimed her life. Soon after her recovery, she began working again, returning to the rhythm of daily life with renewed purpose and strength.She became more than a patient—she became a symbol of what’s possible when compassion and care come together. Her story is one of triumph, and we at the Tibetan Cancer Society are deeply proud to have been a part of her remarkable journey.",
      "date": "June 2018"
    },
    {
      "id": 7,
      "name": "Tamdin Dolma",
      "age": 61,
      "diagnosis": "Carcinoma Stomach Cancer",
      "location": "Maio, Arunachal Pradesh",
      "image": "/assets/testimonials/7.png",
      "quote": "She was diagnosed with signet ring cell carcinoma, a rare and aggressive form of stomach cancer, while undergoing consultations at Rajiv Gandhi Cancer Institute. Struggling with fear and uncertainty, she and her family reached out to the Tibetan Cancer Society for guidance and support.Upon hearing her story, we took her to Delhi State Cancer Institute for further investigations to confirm the diagnosis. The findings were consistent—she indeed had stomach cancer. However, despite the serious nature of her illness, she was determined not to undergo chemotherapy, fearing its side effects and the toll it might take on her body.Doctors at Rajiv Gandhi deemed the cancer unresectable and strongly recommended chemotherapy. But respecting her wishes, we sought a second opinion and took her to Dr. Amit Javed at GB Pant Hospital. After a thorough evaluation, he gave us a glimmer of hope. He believed the tumor was indeed resectable, though the surgery would be extremely high-risk. In order to completely remove the cancer, her entire stomach would need to be surgically taken out.With courage and faith, she decided to go ahead with the operation. The surgery was performed successfully, and we truly believe it was by the blessings of His Holiness the Dalai Lama that everything went smoothly. The strength she showed throughout this process was nothing short of inspiring.It has now been five months since her surgery. Though she experienced some discomfort along the way, recent screenings confirmed that there was no recurrence of cancer. She continues to recover well and is regaining her strength day by day.The surgery itself was performed free of cost at a government hospital, thanks to the support system around her. Her total expenses—mainly for medications, a private room, and some miscellaneous costs—amounted to just ₹40,000 to ₹50,000, a fraction of what private hospitals would have charged (₹8 to ₹12 lakhs)",
      "date": "2021"
    },
    {
      "id": 8,
      "name": "late Karma Dhoundup",
      "age": 73,
      "diagnosis": "Intestine cancer",
      "location": "Choglamser camp 1, Ladakh",
      "image": "/assets/testimonials/late Karma Dhoundup.png",
      "quote": "During one of our cancer awareness and detection camps in Ladakh—generously supported by Tibet Fund and organized by the Tibetan Cancer Society—we encountered a deeply moving case that reminded us why such initiatives matter so much.The patient had previously undergone surgery for an intestinal obstruction at Sonam Memorial Hospital in Leh. Sadly, instead of recovering, his condition worsened with time. During our camp, his family approached us with urgency. They explained that he was too unwell to attend the camp and begged us to visit him at home.Without hesitation, one of our doctors went to see him. The moment he assessed the patient’s condition, he urged the family to fly him to Delhi immediately, warning that he might not survive more than a few days if treatment was delayed.Thanks to the quick response from his family and with the help of the Tibetan Cancer Society, the patient was flown to Delhi just in time. Within a couple of days, he underwent emergency surgery. During the operation, doctors were shocked to find that his intestine had swollen to nearly ten times its normal size. It was a life-or-death situation.Following the surgery, he was kept in critical care for four intense days. Those days were filled with uncertainty, prayer, and hope. And then, a miracle happened—he pulled through. With the grace of the divine and the resilience of the human spirit, he survived. The joy and relief shared between his family, our team, and the hospital staff were beyond words.Our health camp in Ladakh became more than just an awareness program—it became a lifesaving mission.Two months later, the same patient returned to Delhi for a colostomy reversal surgery to remove his colostomy bag. He was admitted at GB Pant Hospital, continuing his recovery with courage and dignity.Today, he is doing remarkably well. His story is a testament to the power of timely intervention, community support, and the unwavering will to live.",
      "date": "2021"
    },
    {
      "id": 9,
      "name": "Tenzin Passang",
      "age": 26,
      "diagnosis": "Breast Cancer",
      "location": "Dharamshala",
      "image": "/assets/testimonials/Tenzin Passang.png",
      "quote": "It was a Saturday in August 2022, and a lump on my breast unveiled a wild, unexpected chapter in my life: Grade 3 breast cancer. In that initial daze of disbelief and confusion, one name echoed in my mind – Cho Tsultrim of the Tibetan Cancer Society. They were the only organization I knew who could possibly understand and help. I reached out, and immediately, a lifeline was thrown. Cho Tsultrim advised me to come to Delhi that very Monday, reassuring me that they would help me find a good oncologist and a place to stay. In that moment of vulnerability, their swift response was a beacon of hope.I decided to embark on the journey to Delhi for treatment, and there, Nurse Rinzin became my steadfast guide. She navigated appointments, follow-ups, and everything in between. Whenever I needed help, her presence was a comforting assurance.My treatment stretched into an intense eight months, marked by eight grueling cycles of chemotherapy, followed by surgery and a month of radiation therapy. The physical and mental exhaustion was immense. Yet, amidst this challenging landscape, the community kitchen at TCS became my sanctuary, a home away from home. The staff and volunteers were constant pillars of support, providing not just meals but also essential healthcare assistance. It was a place where I could find solace in conversations and draw strength from the inspiring stories of fellow patients.One particular TCS initiative, 'Meal for the Invisible,' remains etched in my memory. I vividly recall the aroma when the chef would bring out a huge pot of fragrant fried rice. Suddenly, all the patients, their attendants, and the volunteers would gather, a flurry of hands working together to pack hundreds, sometimes thousand, of meals. Amidst the shared task, laughter and stories flowed freely, weaving a tapestry of human connection. As a patient often feeling weak and dependent, those moments made me feel useful, a vital part of a community striving together.Being a cancer patient demands an extra measure of love, care, and unwavering energy to face the daunting battles. The Tibetan Cancer Society stepped into this role with immense dedication. They were more than just an organization; they were a source of strength, a community that embraced us, and a beacon of hope in the darkest of times. And I am here to say, I won that battle. While the shadow of recurrence may always linger, the same optimism and fighting spirit that carried me through will continue to guide me. My journey through cancer was undeniably arduous, but the unwavering support of TCS transformed it from a solitary fight into a shared victory, a testament to resilience and enduring hope. ",
      "date": "Aug 2022"
    },
    {
      "id": 10,
      "name": "Gen  Choegyal",
      "age": 65,
      "diagnosis": "Carcinoma Stomach Cancer",
      "location": "Dharamshala",
      "image": "/assets/testimonials/Gen  Choegyal.png",
      "quote": "The patient had been diagnosed with advanced adenocarcinoma of the stomach and was referred to the Tibetan Cancer Society by the ever-compassionate Dr. Tsetan la. From the very beginning, it was clear that this was going to be a highly complex case. The cancer had spread extensively across the stomach, and the tumor had grown so large that most hospitals had deemed it inoperable.We were caught in an incredibly difficult situation. If we didn’t proceed with surgery, the patient’s chances of survival were slim—he could succumb to the illness at any moment. On the other hand, if we did choose to operate, the risk was equally terrifying. The chances of him surviving the procedure were low, and the family was warned about the dangers of the operation.It was one of those moments where faith and courage had to lead the way. After much discussion, prayer, and emotional deliberation, the patient’s family made the brave decision to go ahead with the surgery.And then—what we can only describe as a miracle—happened.Under the skilled hands of Dr. Amit Javed at GB Pant Hospital, the surgery was not only performed, but it was a resounding success. When the operation was over, the doctor gently showed us the removed stomach, and we were speechless. It had been almost entirely consumed by tumor cells, with only small patches remaining unaffected. It was hard to imagine how the patient had endured such pain in silence for so long.Despite the odds stacked against him, the patient pulled through. His family, overwhelmed with emotion, expressed deep gratitude for the second chance he had been given.This case reminded all of us at the Tibetan Cancer Society that hope, resilience, and the power of collective support can move mountains. Dr. Amit Javed’s expertise, the family’s faith, and the timely intervention made all the difference.The patient went on to recover steadily, and his journey remains one of the most inspiring examples of courage and miracles we've ever witnessed.",
      "date": "2021"
    },
 {
      "id": 11,
      "name": "Late Ani Pema Choedon",
      "age": 38,
      "diagnosis": "Chronic liver disease Hepatocellular Carcinoma, Breast Cancer",
      "location": "Shugseb Nunnery, Dharamshala",
      "image": "/assets/testimonials/Late Ani Pema Choedon.png",
      "quote": "Miss Pema Choedon, a 38-year-old Tibetan nun, first came to the Tibetan Cancer Society on 14/12/2021, with quiet determination and a heavy heart. For over a year, she had been living with a lump in her left breast—an unsettling presence she could no longer ignore. Along with the lump, she had been experiencing persistent pain in her stomach for several months. Her health was deteriorating, and with limited awareness about her condition and no clear direction for treatment, she reached out to us in a time of deep uncertainty.Ani Pema was already a known case of Hepatitis B and had been on regular medication for her liver condition. However, the growing discomfort and confusion about her health led her to seek help beyond what she could manage on her own.Understanding her vulnerability, we at the Tibetan Cancer Society immediately stepped in to support her—both emotionally and medically. We arranged for her to be seen by Dr. Manish at Rajiv Gandhi Cancer Hospital in Niti Bagh. After a series of medical tests and a biopsy, she was diagnosed with Breast Carcinoma. Though the diagnosis was difficult news, it also marked the beginning of her treatment journey.For her breast cancer, she was prescribed oral chemotherapy, and her medications were started promptly. Her progress was monitored closely. As for her liver condition, we referred her to Dr. Abhishek Bansal at Rajiv Gandhi Cancer Hospital in Rohini. There, she was advised to undergo a TACE (Transarterial Chemoembolization) procedure—a targeted treatment for liver disease. Over time, she bravely underwent three TACE sessions.During her treament, Miss Pema stayed at our Compassionate Home, where she received round-the-clock care from our dedicated nurses and attendants. Eventually, she was shifted back to her monastery to under medication. In 2024, Ani la peacefully passed away.The Tibetan Cancer Society stood by her till the very end. Our Director and staff were present during her cremation, and we provided ambulance services to ensure she received a dignified farewell. Her journey, though filled with pain and struggle, was also one of compassion, care, and community. We honored her strength and were grateful to have walked beside her in her final chapter.",
      "date": "Dec 2021"
    },
    {
      "id": 12,
      "name": "Ven Lobsang Samten",
      "age": 39,
      "diagnosis": "Recurrent Parathyroid cancer",
      "location": "Dharamshala",
      "image": "/assets/testimonials/Ven Lobsang Samten.png",
      "quote": "Ven. Lobsang Samten, a 39-year-old monk, came to the Tibetan Cancer Society on 4/8/2021, after struggling for several months with disturbed sleep and persistent pain in his lower extremities. Behind these troubling symptoms lay a serious diagnosis—he was a known case of Parathyroid Cancer.Back in April 2021, he had undergone surgery for the condition at Apollo Hospital in Mysore. While the procedure offered some temporary relief, his illness continued to progress. Unfortunately, the medical facilities in Mysore were limited, and as his condition worsened, he and his caregivers began searching for better treatment options.In August, they reached out to the Tibetan Cancer Society for guidance and support. We quickly facilitated his transfer to Delhi, where he was referred to Apollo Hospital, Indraprastha. There, he began a new course of treatment under the supervision of renowned oncologist Dr. D. Cruz.Given the extended duration of his treatment, Ven. Lobsang was accommodated at our Compassionate Home. During his stay, our dedicated nurses and caregivers provided round-the-clock support, ensuring that he was cared for with respect, dignity, and compassion throughout his healing journey.After completing the major part of his treatment in Delhi, Ven. Lobsang chose to return to Dharamshala, where he continued his recovery in the comfort of a familiar spiritual environment.",
      "date": "Aug 2021"
    },
    {
      "id": 13,
      "name": "Sonam Chuki",
      "age": 33,
      "diagnosis": "CA cervical ",
      "location": "Nepal",
      "image": "/assets/testimonials/Sonam Chuki.png",
      "quote": "On March 10, 2022, the Tibetan Cancer Society warmly received Mrs. Sonam Chuki, a resilient woman from Nepal who had already been battling cervical cancer for some time. She arrived with a quiet strength and a single concern: to verify whether her cancer had progressed or remained stable. Though her primary treatment had been ongoing in Nepal, she sought clarity and reassurance through a follow-up PET scan, and turned to TCS for support.Understanding the importance of her request, we promptly arranged for the scan within a week of her arrival. The PET scan was conducted under the supervision of Dr. Amit Javed at CK Birla Hospital. Fortunately, the results brought relief on the cervical cancer front—there was no sign of further spread. However, the scan did reveal the presence of multiple gallstones. Dr. Javed advised surgery as a precautionary measure, but since the condition was painless and not causing any immediate discomfort, Mrs. Chuki chose to decline the surgical option. Instead, she opted for a course of medication to manage the condition conservatively.Throughout her brief stay in Delhi, the Tibetan Cancer Society ensured that every aspect of her journey—from travel arrangements to accommodation—was fully taken care of. She stayed in comfort and dignity, surrounded by a supportive environment that allowed her to focus solely on her health and peace of mind.After completing her scan and consultation, Mrs. Sonam Chuki returned to Nepal, reassured and at ease with her decision. Her journey, though short, was a testament to the power of timely care, informed choices, and community support.",
      "date": "March 2022"
    },
    {
      "id": 14,
      "name": "Late Tenzin Penpa",
      "age": "Disclosed",
      "diagnosis": "CA Lung",
      "location": "Bylakuppe",
      "image": "/assets/testimonials/Late Tenzin Penpa.png",
      "quote": "On January 22, 2022, the Tibetan Cancer Society welcomed Mr. Tenzin Penpa, a soft-spoken and humble individual from Bylakuppe. He arrived with a recommendation from Gen Tsultrim la and carried with him a confirmed diagnosis of lung cancer (CA lung). Though facing a daunting illness, Mr. Penpa approached his journey with quiet resilience and hope.Upon his arrival in Delhi, TCS immediately facilitated his medical consultation at Rajiv Gandhi Cancer Institute (RGCI) under the care of Dr. Manish, a specialist in oncology. A series of essential investigations, including an ET scan, were conducted to assess the extent of his condition and determine the most appropriate treatment plan.Throughout this critical time, Mr. Penpa resided at the TCS Compassionate Home, where he received attentive care from our dedicated nursing team. The Compassionate Home became not just a place of medical support, but also a sanctuary of warmth, dignity, and community for him during his treatment.As the months passed, Mr. Penpa expressed his wish to return to his hometown in Bylakuppe. Respecting his decision, TCS ensured a safe and comfortable journey back, continuing to support him from afar as he transitioned into a more familiar and peaceful environment.Over time, his condition gradually declined, and in the later part of the year, Mr. Tenzin Penpa passed away peacefully in his hometown, surrounded by the comfort of his community and the blessings of his spiritual path.His journey remains etched in our hearts—a reminder of the strength found in compassion, the courage in vulnerability, and the deep importance of dignified care at every step of life.",
      "date": "Jan 2022"
    },
    {
      "id": 15,
      "name": "Late Ani Tenzin Pachen",
      "age": 55,
      "diagnosis": "Liver Cirrhosis",
      "location": "Dharamshala",
      "image": "/assets/testimonials/Late Ani Tenzin Pachen.png",
      "quote": "Miss Tenzin Penchen first sought medical attention in 2019 in Dharamsala, Himachal Pradesh, under the care of Dr. Tseten la. She had been experiencing persistent abdominal pain and nausea, symptoms that were initially diagnosed as hepatitis and gastritis. Despite medication, her condition remained a concern. Recognizing the need for more advanced investigations, Dr. Tseten la referred her to the Tibetan Cancer Society (TCS) for further evaluation and guidance.She was received at the Tibetan Cancer Society in early 2020 with warmth and urgency. TCS promptly arranged a consultation with the renowned hepatologist Dr. Sarin at the Institute of Liver and Biliary Sciences (ILBS), Delhi. After a detailed medical evaluation, she was diagnosed with liver cirrhosis. However, given her symptoms and the seriousness of her condition, a PET scan and a series of cancer marker tests, including AFP, were conducted to rule out any malignancy.Unfortunately, the results confirmed the presence of cancerous indicators. Despite the difficult news, Miss Penchen continued her treatment under Dr. Sarin’s supervision. In an effort to manage the progression of her liver disease and the growing threat of cancer, Transarterial Chemoembolization (TACE) procedures were carried out twice—once in January 2020 and again in January 2021.While the procedures offered temporary relief, her overall health continued to decline. By early 2022, her medical team—including Dr. Sarin and Dr. Tseten la—re-evaluated the possibility of chemotherapy and radiotherapy. However, given the advanced stage of her disease and her weakened physical state, it was collectively agreed that pursuing further aggressive treatments would not be in her best interest.On February 6, 2022, Miss Penchen returned to Dharamsala to spend her remaining time in a more peaceful environment, surrounded by familiar faces. She had faced her illness with quiet determination and grace, and despite the pain, she remained deeply appreciative of the care and kindness she received throughout her medical journey.The Tibetan Cancer Society took full responsibility for her medical journey—from consultations, lab investigations, and procedures to accommodation and medications—ensuring she never had to face her illness alone.",
      "date": "2019"
    },
    {
      "id": 16,
      "name": "Tseten",
      "age": 62,
      "diagnosis": "CA Stomach",
      "location": "Gangtok, Sikkim",
      "image": "/assets/testimonials/Tseten.png",
      "quote": "On February 15, 2022, the Tibetan Cancer Society (TCS) received Mr. Tseten from Gangtok, Sikkim, with a heartfelt recommendation from Dr. Tseten la. He arrived with a confirmed diagnosis of stomach cancer (CA stomach) and a spirit quietly rooted in hope and resilience. Understanding the urgency of his condition, TCS facilitated immediate medical support and coordinated his consultations at the Rajiv Gandhi Cancer Institute (RGCI) in Delhi.At RGCI, Mr. Tseten underwent a repeat PET scan and a series of advanced cancer marker investigations. The reports confirmed the presence of a significant tumor in his stomach. He was then placed under the care of oncologist Dr. Shivender, who advised surgical removal of the tumor. Plans for the operation moved forward cautiously, but during pre-operative evaluations, a complex medical history came to light.Mr. Tseten had previously suffered from a severe case of COVID-19, a battle that had left his lungs weakened. Post-COVID, he had also been diagnosed with tuberculosis (TB), for which he was undergoing treatment under Dr. Tseten la in Dharamsala. These additional medical complications posed a significant risk, making him temporarily unfit to undergo major surgery.Recognizing the delicacy of the situation, a second opinion was sought from a senior pulmonologist at another hospital. Both medical teams—alongside the patient—reached a unified and compassionate decision: to delay surgery until his lung health had improved and his body was better prepared to withstand the physical toll of an operation.With this plan in place, Mr. Tseten was transferred to Delek Hospital in Dharamsala, where he continued his tuberculosis treatment under the attentive care of Dr. Tseten la. Though his cancer treatment had to be temporarily paused, his journey remained one of quiet courage, medical perseverance, and the unyielding support of TCS.",
      "date": "Feb 2022"
    }
  ]
}
