{
  "id": "compassion-home",
  "title": "Compassion Home",
  "shortDescription": "A safe and supportive residence for cancer patients undergoing treatment away from home.",
  "fullDescription": "Compassion Home – Tibetan Cancer Society\nCompassion Home, an initiative of the Tibetan Cancer Society, provides complimentary accommodation with essential amenities for cancer patients undergoing treatment away from their homes. The facility is thoughtfully designed to offer comfort, privacy, and comprehensive support during this challenging period.We provide individual, air-conditioned rooms with attached washrooms to ensure maximum privacy and convenience. Each patient is also granted access to a separate kitchen space, enabling them to prepare meals tailored to their specific dietary needs and personal preferences.\nCompassion Home offers round-the-clock nursing care, ensuring that any medical requirements are promptly and professionally addressed at all times. To support respiratory health, the facility is equipped with air purifiers, oxygen concentrators, and a steady supply of medical oxygen. Additionally, an ambulance is stationed on-site to guarantee immediate assistance in case of emergencies.\nOur mission is to create a safe, nurturing, and supportive environment where patients receive holistic care that attends to both their medical and emotional well-being throughout their treatment journey. At Compassion Home, patients find not only a place to stay but a compassionate community dedicated to their comfort, dignity, and recovery.",
  "icon": "Home",
  "image": "/assets/programs/compassion-home.jpg",
  "features": [
    "Safe and comfortable accommodation",
    "Nutritious meals prepared with care",
    "Transportation to and from treatment centers",
    "Emotional support from staff and fellow residents",
    "Regular visits from healthcare professionals"
  ],
  "stats": [
    {
      "value": "200+",
      "label": "Patients Housed"
    },
    {
      "value": "3000+",
      "label": "Nights of Accommodation Provided"
    }
  ],
  "contactPerson": "Pema Yangzom",
  "contactEmail": "compassionhome@tibetancancersociety.org"
}
